---
kind: type
id: T:Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings
source: html/2e74462f-4216-f6eb-d560-87a1b103e87e.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings

Contains vector settings for analysis display style element.

## Syntax (C#)
```csharp
public class AnalysisDisplayVectorSettings : IDisposable
```